/* Завдання 3: Генерація таблиці множення

Створіть програму, яка генерує таблицю множення для обраного числа за допомогою кожного з циклів for, while .

Виберіть число для якого потрібно згенерувати таблицю множення.
Використовуючи цикл for, створіть таблицю множення для обраного числа від 1 до 10. Виведіть результат в консоль.
Використовуючи цикл while створіть аналогічну таблицю множення та виведіть її в консоль. */


const number = 10;


// for (let i = 1; i < 11; i++) {
//     console.log(number + " x " + i + " = " + number*i)
//   }



i = 0;
while (i < 11){
    console.log(number + " x " + i + " = " + number*i);
    i++;
}


// i = 0;
// do {
//     console.log(number + " x " + i + " = " + number*i);
//     i++;
// } while (i > 0 && i <=10)
